
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	//СтандартнаяОбработка = Ложь;
	//ГруппаКонструктора = Справочники.Номенклатура.НайтиПоНаименованию("Товары");

	//ОтборПоГруппе = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	//ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	//ОтборПоГруппе.ПравоеЗначение = ГруппаКонструктора;

	//ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);

	//ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Видимость", Истина );
	//ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Отображать",Истина );

	//ОтборПоГруппе = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборПоГруппе.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
	//ОтборПоГруппе.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	//ОтборПоГруппе.ПравоеЗначение = ГруппаКонструктора;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	ОповеститьОВыборе(Значение);
КонецПроцедуры
