
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр КадроваяИсторияСотрудников
	Движения.КадроваяИсторияСотрудников.Записывать = Истина;
	Движение = Движения.КадроваяИсторияСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.Подразделение = Подразделение;
	Движение.Должность = Должность;

	// регистр ВидыЗанятостиСотрудников
	Движения.ВидыЗанятостиСотрудников.Записывать = Истина;
	Движение = Движения.ВидыЗанятостиСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.Сотрудник = Сотрудник;
	Движение.ВидЗанятости = ВидЗанятости;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
