&НаСервере
Функция ПолучитьРодителяВерхнегоУровня() 
	Возврат Объект.Родитель.Родитель;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Родитель.Пустая() ИЛИ ПолучитьРодителяВерхнегоУровня().Пустая()  Тогда
		Сообщить("На данном уровне создание элементов запрещено!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ЗаполнитьВидНоменклатуры();
КонецПроцедуры


&НаСервере
Функция ПолучитьВидНоменклатурыРодителя()
	Возврат Объект.Родитель.ВидНоменклатуры;
КонецФункции 


&НаКлиенте
Процедура ЗаполнитьВидНоменклатуры()
	Если НЕ Объект.Родитель.Пустая() Тогда	
		Объект.ВидНоменклатуры = ПолучитьВидНоменклатурыРодителя();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	ЗаполнитьВидНоменклатуры();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры
