&НаСервере
Функция ПолучитьССылкуНаГруппуНоменклатуры(НазваниеГруппы)   
	Возврат Справочники.Номенклатура.НайтиПоНаименованию(НазваниеГруппы); 
КонецФункции            


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)    
	Если НЕ Объект.Родитель.Пустая() Тогда   
		ССылкаНаГруппуТовары = ПолучитьССылкуНаГруппуНоменклатуры("Товары"); 
		ССылкаНаГруппуУслуги = ПолучитьССылкуНаГруппуНоменклатуры("Услуги");
		
		Если Объект.Родитель = ССылкаНаГруппуТовары Тогда
			Объект.ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Товары"); 
		ИначеЕсли Объект.Родитель = ССылкаНаГруппуУслуги Тогда
			Объект.ВидНоменклатуры = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуги");
		КонецЕсли;                                                                                   
	КонецЕсли	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
КонецПроцедуры


&НаСервере
Функция ПолучитьВидНоменклатурыРодителя()
	Возврат Объект.Родитель.ВидНоменклатуры;
КонецФункции 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьВидНоменклатуры()
	Если НЕ Объект.Родитель.Пустая() Тогда	
		Объект.ВидНоменклатуры = ПолучитьВидНоменклатурыРодителя();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьВидНоменклатуры();
КонецПроцедуры


&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	ЗаполнитьВидНоменклатуры();
КонецПроцедуры
	
