  &НаКлиенте
Перем мНоменклатураТовары; 
&НаКлиенте
Перем мНоменклатураУслуги;     

&НаКлиенте
Функция ПолучитьЗаголовокКнопки(ИмяКоманды)
	Если не ТипЗнч(ИмяКоманды) = Тип("Строка") Тогда
		ВызватьИсключение("ИмяКоманды должно иметь тип Строка");	
	КонецЕсли;
	Для каждого Кнопка Из ЭтаФорма.Элементы.Реализация.ПодчиненныеЭлементы Цикл
		Если не ТипЗнч(Кнопка) = Тип("КнопкаФормы") Тогда		
			Продолжить;		
		КонецЕсли;
		Если Кнопка.ИмяКоманды = ИмяКоманды Тогда			
			Возврат Кнопка.Заголовок; 			
		КонецЕсли;		
	КонецЦикла;
	Возврат "";
КонецФункции


&НаКлиенте
Процедура СоздатьРеализацияТовары(Команда)
	ОткрытьФормуДокументаРеализацияНоменклатуры(мНоменклатураТовары, ПолучитьЗаголовокКнопки(Команда.Имя));
КонецПроцедуры

&НаКлиенте
Процедура СозданиеРеализацииУслуг(Команда)
	ОткрытьФормуДокументаРеализацияНоменклатуры(мНоменклатураУслуги, ПолучитьЗаголовокКнопки(Команда.Имя));
КонецПроцедуры  

&НаКлиенте     
Процедура ОткрытьФормуДокументаРеализацияНоменклатуры(ВидНоменклатуры, Заголовок)
	#Область ПроверкаПараметров	
	Если не ТипЗнч(ВидНоменклатуры) = Тип("ПеречислениеСсылка.ВидыНоменклатуры") Тогда
		ВызватьИсключение("ВидНоменклатуры должно иметь тип ПеречислениеСсылка.ВидыНоменклатуры");	
	КонецЕсли;
	Если не ТипЗнч(Заголовок) = Тип("Строка") Тогда
		ВызватьИсключение("Заголовок должно иметь тип Строка");	
	КонецЕсли;  
	#КонецОбласти
	ФормаДокументаРеализацияНоменклатуры = ПолучитьФорму("Документ.РеализацияНоменклатуры.ФормаОбъекта");
	Если ФормаДокументаРеализацияНоменклатуры.Открыта() Тогда
		ФормаДокументаРеализацияНоменклатуры.Активизировать();
	Иначе	
		ФормаДокументаРеализацияНоменклатуры.Заголовок = Заголовок;
	    ФормаДокументаРеализацияНоменклатуры.Объект.ВидНоменклатуры = ВидНоменклатуры;		
	    ФормаДокументаРеализацияНоменклатуры.Открыть();  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
   мНоменклатураТовары = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Товары");
   мНоменклатураУслуги = ПредопределенноеЗначение("Перечисление.ВидыНоменклатуры.Услуги");
КонецПроцедуры
