
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ЦеныНоменклатуры
	Движения.ЦеныНоменклатуры.Записывать = Истина;
	Для Каждого ТекСтрокаЦеныНоменклатуры Из ЦеныНоменклатуры Цикл
		Движение = Движения.ЦеныНоменклатуры.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаЦеныНоменклатуры.Номенклатура;
		Движение.ВидЦены = ВидЦены;
		Движение.Цена = ТекСтрокаЦеныНоменклатуры.Цена;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

//Процедура ОбработкаПроведения(Отказ, Режим)
//	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//	// Данный фрагмент построен конструктором.
//	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

//	// регистр ЦеныНоменклатуры
//	Движения.ЦеныНоменклатуры.Записывать = Истина;
//	Для Каждого ТекСтрокаЦеныНоменклатуры Из ЦеныНоменклатуры Цикл
//		Движение = Движения.ЦеныНоменклатуры.Добавить();
//		Движение.Период = Дата;
//		Движение.Номенклатура = ТекСтрокаЦеныНоменклатуры.Номенклатура;
//		Движение.Цена = ТекСтрокаЦеныНоменклатуры.Цена;
//		Движение.Оптовая = ТекСтрокаЦеныНоменклатуры.Оптовая;
//		Движение.Цена = ТекСтрокаЦеныНоменклатуры.Количество;
//	КонецЦикла;

//	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
//КонецПроцедуры
