
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр Продажи 
	Движения.Продажи.Записывать = Истина;
	Для Каждого ТекСтрокаТовар Из Номенклатура Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовар.Номенклатура;
		Движение.Сумма = ТекСтрокаТовар.Сумма;
		Движение.Количество = ТекСтрокаТовар.Количество;
	КонецЦикла;

	// регистр ТоварыНаСкладе Расход
	Движения.ТоварыНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаТовар Из Номенклатура Цикл
		Движение = Движения.ТоварыНаСкладе.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовар.Номенклатура;
		Движение.Количество = ТекСтрокаТовар.Количество;
	КонецЦикла;

	// регистр ДенежныеСредства Приход
	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сумма = ОбщаяСумма;

КонецПроцедуры
